IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CBASS_INFRA1_ISC.xml
	<register id="ISC_REGS_Ipulsar_lite_main_0_cpu1_pmst_isc_region_0_start_address_l" acronym="ISC_REGS_Ipulsar_lite_main_0_cpu1_pmst_isc_region_0_start_address_l" offset="0x410" width="32" description="The ISC Region 0 Start Address Low Register defines the start address bits 31 to 0 for the master Ipulsar_lite_main_0.cpu1_pmst region 0 ISC.">
		<bitfield id="START_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="Start address bits 31 to 12." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="START_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x0" description="Start address bits 11 to 0 must be 0 as address must be 4KB aligned in address mode. Can also be channel number in channel mode." range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipulsar_lite_main_0_cpu1_pmst_isc_region_0_start_address_h" acronym="ISC_REGS_Ipulsar_lite_main_0_cpu1_pmst_isc_region_0_start_address_h" offset="0x414" width="32" description="The ISC Region 0 Start Address High Register defines the start address bits 47 to 32 for the master Ipulsar_lite_main_0.cpu1_pmst region 0 ISC.">
		<bitfield id="START_ADDRESS_H" width="16" begin="15" end="0" resetval="0x0" description="Start address bits 47 to 32." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipulsar_lite_main_0_cpu1_pmst_isc_region_0_end_address_l" acronym="ISC_REGS_Ipulsar_lite_main_0_cpu1_pmst_isc_region_0_end_address_l" offset="0x418" width="32" description="The ISC Region 0 End Address Low Register defines the end included address bits 31 to 0 for the master Ipulsar_lite_main_0.cpu1_pmst region 0 ISC.">
		<bitfield id="END_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="End address bits 31 to 12 to include in the match." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="END_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x4095" description="End address bits 11 to 0 are forced to Fs as address must be 4KB aligned." range="11 - 0" rwaccess="R"/>
	</register>
	<register id="ISC_REGS_Ipulsar_lite_main_0_cpu1_pmst_isc_region_0_end_address_h" acronym="ISC_REGS_Ipulsar_lite_main_0_cpu1_pmst_isc_region_0_end_address_h" offset="0x41C" width="32" description="The ISC Region 0 End Address High Register defines the end address bits 47 to 32 for the master Ipulsar_lite_main_0.cpu1_pmst region 0 ISC.">
		<bitfield id="END_ADDRESS_H" width="16" begin="15" end="0" resetval="0x0" description="End address bits 47 to 32." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipulsar_lite_main_0_cpu1_pmst_isc_region_def_control" acronym="ISC_REGS_Ipulsar_lite_main_0_cpu1_pmst_isc_region_def_control" offset="0x420" width="32" description="The ISC Default Region Control Register defines the control fields for the master Ipulsar_lite_main_0.cpu1_pmst region 1 ISC.">
		<bitfield id="NOPRIV" width="2" begin="27" end="26" resetval="0x0" description="Clear output priv attribute. If each bit is set then the outgoing priv bit is cleared, else the bit is unchanged. Do not set both priv and nopriv for the same bit." range="27 - 26" rwaccess="R/W"/> 
		<bitfield id="PRIV" width="2" begin="25" end="24" resetval="0x0" description="Set outgoing priv attribute. If each bit is set then the outgoing priv bit is set, else the bit is unchanged. Do not set both priv and nopriv for the same bit." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PASS" width="1" begin="21" end="21" resetval="0x0" description="No privID replacement. A value of 1 will pass through privid value. A value of 0 will replace privid with priv_id field value." range="21" rwaccess="R/W"/> 
		<bitfield id="NONSEC" width="1" begin="20" end="20" resetval="0x0" description="Make outgoing non-secure. A value of 1 forces secure clear, others do nothing. Do not set both sec and nonsec." range="20" rwaccess="R/W"/> 
		<bitfield id="SEC" width="4" begin="19" end="16" resetval="0x0" description="Make outgoing secure. A value of 0xA forces secure set, others do nothing. Do not set both sec and nonsec." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PRIV_ID" width="8" begin="15" end="8" resetval="0x213" description="Priv ID value to use if pass is 0." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="DEF" width="1" begin="6" end="6" resetval="0x1" description="Default region indication. The default region is used when all other regions do not match." range="6" rwaccess="R"/> 
		<bitfield id="CH_MODE" width="1" begin="5" end="5" resetval="0x0" description="Enable channel mode to match region to a chanid value. Otherwise use address mode to match region to an address range." range="5" rwaccess="R"/> 
		<bitfield id="LOCK" width="1" begin="4" end="4" resetval="0x0" description="Lock region. Once set, the region values cannot be modified." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="ENABLE" width="4" begin="3" end="0" resetval="0x10" description="Enable region. A value of 0xA enables, others disable." range="3 - 0" rwaccess="R"/>
	</register>
	<register id="ISC_REGS_Ipulsar_lite_main_1_cpu0_pmst_isc_region_0_control" acronym="ISC_REGS_Ipulsar_lite_main_1_cpu0_pmst_isc_region_0_control" offset="0x800" width="32" description="The ISC Region 0 Control Register defines the control fields for the master Ipulsar_lite_main_1.cpu0_pmst region 0 ISC.">
		<bitfield id="NOPRIV" width="2" begin="27" end="26" resetval="0x0" description="Clear output priv attribute. If each bit is set then the outgoing priv bit is cleared." range="27 - 26" rwaccess="R/W"/> 
		<bitfield id="PRIV" width="2" begin="25" end="24" resetval="0x0" description="Set outgoing priv attribute. If each bit is set then the outgoing priv bit is set." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PASS" width="1" begin="21" end="21" resetval="0x0" description="No privID replacement, pass through value." range="21" rwaccess="R/W"/> 
		<bitfield id="NONSEC" width="1" begin="20" end="20" resetval="0x0" description="Make outgoing non-secure." range="20" rwaccess="R/W"/> 
		<bitfield id="SEC" width="4" begin="19" end="16" resetval="0x0" description="Make outgoing secure. A value of 0xA enables, others disable." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PRIV_ID" width="8" begin="15" end="8" resetval="0x214" description="Priv ID." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="DEF" width="1" begin="6" end="6" resetval="0x0" description="Default region indication. The default region is used when all other regions do not match." range="6" rwaccess="R"/> 
		<bitfield id="CH_MODE" width="1" begin="5" end="5" resetval="0x0" description="Enable channel mode to match region to a chanid value. Otherwise use address mode to match region to an address range." range="5" rwaccess="R/W"/> 
		<bitfield id="LOCK" width="1" begin="4" end="4" resetval="0x0" description="Lock region. Once set the region values cannot be modified." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="ENABLE" width="4" begin="3" end="0" resetval="0x0" description="Enable region. A value of 0xA enables, others disable." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipulsar_lite_main_1_cpu0_pmst_isc_region_0_start_address_l" acronym="ISC_REGS_Ipulsar_lite_main_1_cpu0_pmst_isc_region_0_start_address_l" offset="0x810" width="32" description="The ISC Region 0 Start Address Low Register defines the start address bits 31 to 0 for the master Ipulsar_lite_main_1.cpu0_pmst region 0 ISC.">
		<bitfield id="START_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="Start address bits 31 to 12." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="START_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x0" description="Start address bits 11 to 0 must be 0 as address must be 4KB aligned in address mode. Can also be channel number in channel mode." range="11 - 0" rwaccess="R/W"/>
	</register>
